ws-asahi/UkiUkiCore/megaavr/variants/WazamonoTachi/pins_arduino.h
/* pins_arduino.h - Variant definition for the Wazamono Tachi (AVR64DU32)
 * ---------------------------------------------------------------------------
 * Part of WazamonoCore (a product-specific fork of SpenceKonde/DxCore).
 * DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see LICENSE.md),
 * based on existing Arduino cores. This variant (C) Workshop Asahi 2026.
 *
 * Board   : Wazamono Tachi  (Pro Micro form factor, AVR64DU32, USB-C, Grove)
 * MCU     : AVR64DU32  (32-pin TQFP/VQFN)
 * Clock   : external 24 MHz crystal on PA0/PA1 (XTALHF1/XTALHF2)
 *           -> boards.txt must select an external-HF-crystal clock option, so
 *              CLOCK_SOURCE & 0x03 == 1 and PA0/PA1 are removed from the GPIO map.
 *           -> USB CLK_USB (48 MHz) is still produced by OSCHF + PLL48M and is
 *              auto-tuned to the USB SOF, independently of this crystal.
 *
 *  ===== Pin numbering: Pro Micro compatible (NONCANONICAL), rev.2 =====
 *   D#   MCU   Pro Micro role / notes
 *   D0   PA5   RX  (Serial1 = USART0 RX, ALT1)       A11, AIN25
 *   D1   PA4   TX  (Serial1 = USART0 TX, ALT1)       A12, AIN24
 *   D2   PA2   SDA (Grove I2C)                       A13, AIN22
 *   D3   PA3   SCL (Grove I2C) | ~PWM(TCB1) | LUT0-OUT   A14, AIN23
 *   D4   PD7   (hardware SPI SS) | Serial2 RX (USART1)   A6,  AIN7
 *   D5   PD0   ~PWM(TCA0 WO0) | LUT2-IN0             A15, AIN0
 *   D6   PD1   ~PWM(TCA0 WO1) | LUT2-IN1             A7,  AIN1
 *   D7   PA6   USART0 XCK                            A16, AIN26
 *   D8   PA7   USART0 XDIR | AC0 OUT | EVOUTA | CLKOUT   A8, AIN27
 *   D9   PD2   ~PWM(TCA0 WO2) | LUT2-IN2 | AINP0 | EVOUTD  A9, AIN2
 *   D10  PD3   ~PWM(TCA0 WO3) | LUT2-OUT | AINN0     A10, AIN3
 *   D11..D12   (do not exist - gap, like the 32U4 Pro Micro)
 *   D13  PC3   LED_BUILTIN (on-board, active-HIGH) | LUT1-OUT   A19, AIN31
 *              (D13 does not exist on a real Pro Micro; added as the classic
 *               Uno/Leonardo LED pin. LUT1 has no input pins on the DU-32, so
 *               the CCL can drive this LED from internal/event inputs.)
 *   D14  PD5   MISO | ~PWM(TCA0 WO5)                 A20, AIN5
 *   D15  PD6   SCK  | Serial2 TX (USART1)            A21, AIN6
 *   D16  PD4   MOSI | ~PWM(TCA0 WO4)                 A22, AIN4
 *   D17  PF4   RX LED (on-board, active-LOW, no header)   A23, AIN20
 *   D18  PF0   A0 | LUT3-IN0                         AIN16
 *   D19  PF1   A1 | LUT3-IN1                         AIN17
 *   D20  PF2   A2 | LUT3-IN2 | EVOUTF                AIN18
 *   D21  PF3   A3 | LUT3-OUT                         AIN19
 *   D22..D29   (do not exist - gap)
 *   D30  PF5   TX LED (on-board, active-LOW, no header)   A30, AIN21
 *   --- not on the Pro Micro header (appended so the arrays are complete) ---
 *        PA0   XTALHF1 (24 MHz crystal)              index 31  (NOT_A_PIN)
 *        PA1   XTALHF2 (24 MHz crystal)              index 32  (NOT_A_PIN)
 *        PF6   RESET                                 index 33
 *        PF7   UPDI                                  index 34  (== PIN_PF7, highest)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTD (WO0..WO5 = PD0..PD5 = D5/D6/D9/D10/D16/D14) : TCA0_PINS below
 *            -> classic Pro Micro PWM set D3/D5/D6/D9/D10 is fully reproduced;
 *               D14/D16 gain bonus PWM (mutually exclusive with SPI use).
 *   TCB1  -> PA3 (D3) default position               : ~PWM on D3
 *   millis-> TCB0  : boards.txt MUST pass -DMILLIS_USE_TIMERB0 so TCB1 is free for D3 PWM
 *   SPI0  -> ALT4 (PD4/PD5/PD6/PD7 = D16/D14/D15/D4), the ONLY position offered:
 *            the DEFAULT position (PA4..PA7) is occupied by USART0/Serial1.
 *            Board is SPI host; chip-selects are user GPIO (auto-SS not used).
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = the Grove connector. No UART sharing
 *            in this revision: Wire and Serial1/Serial2 can all run together.
 *   USART0-> Serial1, ALT1 (PA4 TX / PA5 RX / PA6 XCK / PA7 XDIR) = D1/D0/D7/D8.
 *            Full-function position: XCK/XDIR enable USART-SPI-host and RS-485.
 *   USART1-> Serial2, ALT2 (PD6 TX / PD7 RX) = D15/D4. (Only usable USART1
 *            position.) Shares pins with SPI SCK/SS, so Serial2 and SPI are
 *            mutually exclusive (use one or the other).
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 *
 *   NOTE on names: in DxCore USART0 is "Serial0" and USART1 is "Serial1".
 *   On this board the Pro Micro D0/D1 UART is USART0, so the user-facing name
 *   Serial1 must attach to USART0. WAZAMONO_SERIAL1_IS_USART0 (below) makes
 *   the core emit Serial1 as an alias of the Serial0 object (UART0.cpp), and
 *   WAZAMONO_SERIAL2_IS_USART1 renames USART1's object to Serial2 (UART1.cpp,
 *   HardwareSerial.h). Serial0 remains as the internal alias for USART0.
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Informational pinout tags. DU_32PIN_PINOUT keeps DU-32 feature assumptions in
 * the core; WAZAMONO_TACHI_PINOUT identifies this board. NONCANONICAL_PIN_NUMBERS
 * tells the core to derive (port,bit) from the tables below instead of assuming
 * pin number == port order (our numbering does not follow port order). */
#define DU_32PIN_PINOUT
#define WAZAMONO_TACHI_PINOUT
#define WAZAMONO_BOARD_TACHI 1  /* Board identification macro (matches bootloader convention) */
#define NONCANONICAL_PIN_NUMBERS

/* ---- User-facing serial names (core support in UART0.cpp / UART1.cpp /
 * HardwareSerial.h; this header is included by Arduino.h *before* UART.h, so
 * these are visible to every core translation unit): ---------------------
 *   Serial1 -> USART0 (D0/D1, the Pro Micro hardware UART)  [alias of Serial0]
 *   Serial2 -> USART1 (D15 TX / D4 RX)                      [renamed object]  */
#define WAZAMONO_SERIAL1_IS_USART0
#define WAZAMONO_SERIAL2_IS_USART1

         /*##  ### #   #  ###
          #   #  #  ##  # #
          ####   #  # # #  ###
          #      #  #  ##     #
          #     ### #   #  # */
/* Digital pin number for each MCU pin (Pro Micro layout, rev.2). */
#define PIN_PA5 (0)   // D0  RX  (Serial1 = USART0 RX)
#define PIN_PA4 (1)   // D1  TX  (Serial1 = USART0 TX)
#define PIN_PA2 (2)   // D2  SDA
#define PIN_PA3 (3)   // D3  SCL / TCB1 PWM / LUT0-OUT
#define PIN_PD7 (4)   // D4  SPI SS / Serial2 RX
#define PIN_PD0 (5)   // D5  TCA0 WO0
#define PIN_PD1 (6)   // D6  TCA0 WO1
#define PIN_PA6 (7)   // D7  USART0 XCK
#define PIN_PA7 (8)   // D8  USART0 XDIR / AC0 OUT / EVOUTA / CLKOUT
#define PIN_PD2 (9)   // D9  TCA0 WO2 / AINP0 / EVOUTD
#define PIN_PD3 (10)  // D10 TCA0 WO3 / AINN0
//  no  D11..D12               (gap)
#define PIN_PC3 (13)  // D13 LED_BUILTIN (active-HIGH) / LUT1-OUT
#define PIN_PD5 (14)  // D14 MISO / TCA0 WO5
#define PIN_PD6 (15)  // D15 SCK / Serial2 TX
#define PIN_PD4 (16)  // D16 MOSI / TCA0 WO4
#define PIN_PF4 (17)  // D17 RX LED (active-LOW, on-board only)
#define PIN_PF0 (18)  // D18 A0
#define PIN_PF1 (19)  // D19 A1
#define PIN_PF2 (20)  // D20 A2 / EVOUTF
#define PIN_PF3 (21)  // D21 A3
//  no  D22..D29               (gap)
#define PIN_PF5 (30)  // D30 TX LED (active-LOW, on-board only)
#define PIN_PA0 (31)  // XTALHF1 (crystal)
#define PIN_PA1 (32)  // XTALHF2 (crystal)
#define PIN_PF6 (33)  // RESET
#define PIN_PF7 (34)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 35)

/* ---- Event output pins: FIXED by the board's pin-configuration table ----
 * One pin per event output, no alternatives. Libraries (CustomLogic, and the
 * EventSystem library in its Wazamono form) route event outputs to these only.
 *   EVOUTA -> PA7 = D8   (PORTMUX ALT1;    default PA2 is the Grove SDA)
 *   EVOUTD -> PD2 = D9   (PORTMUX default)
 *   EVOUTF -> PF2 = D20  (PORTMUX default) */
#define WAZAMONO_EVOUTA_PIN            (PIN_PA7)
#define WAZAMONO_EVOUTA_ALT            (1)
#define WAZAMONO_EVOUTD_PIN            (PIN_PD2)
#define WAZAMONO_EVOUTD_ALT            (0)
#define WAZAMONO_EVOUTF_PIN            (PIN_PF2)
#define WAZAMONO_EVOUTF_ALT            (0)

         /*##   ##   ###  ###  ###  ###
          #   # #  # #      #  #    #
          ####  ####  ###   #  #     ###
          #   # #  #     #  #  #        #
          ####  #  # ####  ###  ###  # */
#define PINS_COUNT                     (35)  // length of the pin tables (incl. gaps/reserved)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 35
// NUM_INTERNALLY_USED_PINS           -> auto = 2 (external crystal: PA0, PA1)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PC3)   // D13, dedicated LED (active-HIGH)
#endif
#define LED_BUILTIN_RX                 (PIN_PF4)   // D17 RX LED (active-LOW, Pro Micro convention)
#define LED_BUILTIN_TX                 (PIN_PF5)   // D30 TX LED (active-LOW, Pro Micro convention)

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

         /*   #  ###   ### ####   ###   ###
          ## ## #   # #    #   # #   # #
          # # # ##### #    ####  #   #  ###
          #   # #   # #    # #   #   #     #
          #   # #   #  ### #  #   ###   ## */
/* Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used). */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD0 ?  0 : (p) == PIN_PD1 ?  1 : (p) == PIN_PD2 ?  2 : (p) == PIN_PD3 ?  3 : \
    (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PF0 ? 16 : (p) == PIN_PF1 ? 17 : (p) == PIN_PF2 ? 18 : (p) == PIN_PF3 ? 19 : \
    (p) == PIN_PF4 ? 20 : (p) == PIN_PF5 ? 21 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  0 ? PIN_PD0 : (p) ==  1 ? PIN_PD1 : (p) ==  2 ? PIN_PD2 : (p) ==  3 ? PIN_PD3 : \
    (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 16 ? PIN_PF0 : (p) == 17 ? PIN_PF1 : (p) == 18 ? PIN_PF2 : (p) == 19 ? PIN_PF3 : \
    (p) == 20 ? PIN_PF4 : (p) == 21 ? PIN_PF5 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

